1s/ERP/Conf/Documents/Лико_ОтчетФормщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ОтчетФормщика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатурыКоробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатурыОстатокОтКоробки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьФормИтог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Comment>1 - отчет формщика, 2 - списание брака</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистовКСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзготовленныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФормы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиЗаказа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФормы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолимера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ТС_СостоянияРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТС_СостоянияРемонтныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятИзПлана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоРаспоряжению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаДругойСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_РежимЗакрытияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_РежимЗакрытияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереместитьНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставитьНаРабочемЦентре</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОперацийЗакрытияБланка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОперацийЗакрытияБланка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеБланка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаРазборка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ОтчетФормщика/Ext/ObjectModule.bsl
Перем КлючиСтруктуры;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда
		ВидДокумента = 1;
	КонецЕсли;

	Площадка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "Лико_Площадка");
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Площадка, "Организация");

	СтрокиКУдалению = ИзготовленныеФормы.НайтиСтроки(Новый Структура("Отметка", Ложь));
	Для каждого ТекСтрокаКУдалению из СтрокиКУдалению Цикл
		ИзготовленныеФормы.Удалить(ТекСтрокаКУдалению);
	КонецЦикла;
	
	ПлощадьФормИтог = 0;
	Для каждого Строка из ИзготовленныеФормы Цикл
		ПлощадьФормИтог = ПлощадьФормИтог + Строка.ПлощадьФормы;
	КонецЦикла; 

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Ссылка.Проведен Тогда
			// Запретим проводить проведенные документы
			Сообщить("" + Ссылка + ": запрещено изменять проведенный документ. Сначала отмените проведение");
			Отказ = Истина;
		КонецЕсли; 
		
		Если ВидДокумента = 2 И ИзготовленныеФормы.Количество() > 0 Тогда
			Сообщить("При списании брака полимера не нужно отмечать формы");
			Отказ = Истина;
		КонецЕсли; 
		
		Если ВидДокумента = 2 И КоличествоЛистовКСписанию = 0 Тогда
			Сообщить("При списании брака полимера необходимо указать количество листов к списанию");
			Отказ = Истина;
		КонецЕсли; 
		
		Если ВидДокумента = 2 И КоличествоЛистовКСписанию > ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель Тогда
			Сообщить("Количество листов к списанию не может быть больше, чем количество листов в коробке");
			Отказ = Истина;
		КонецЕсли; 
		
		Если ВидДокумента = 1 И ИзготовленныеФормы.Количество() = 0 Тогда
			Сообщить("Необходимо выбрать изготовленные формы");
			Отказ = Истина;
		КонецЕсли; 

		Если Остаток И Остатки.Количество() = 0 Тогда
			Сообщить("Необходимо указать размеры остатков");
			Отказ = Истина;
		КонецЕсли;
		
		Если Остаток Тогда
			ПлощадьОстатка = 0;
			Для каждого ТекСтрокаОстатка из Остатки Цикл
				ПлощадьОстатка = ПлощадьОстатка + (ТекСтрокаОстатка.Длина * ТекСтрокаОстатка.Ширина);
			КонецЦикла;
			Если ПлощадьОстатка = 0 Тогда
				Сообщить("Площадь остатка не может быть равна 0");
				Отказ = Истина;
			ИначеЕсли ПлощадьФормИтог + ПлощадьОстатка > ПлощадьЛиста Тогда
				Сообщить("Площадь форм + площадь остатка (" + (ПлощадьФормИтог + ПлощадьОстатка) + ") не может быть больше площади листа (" + ПлощадьЛиста + ")");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ПодобратьОстатокОтКоробки();
			ПодобратьОстаткиЛистов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачатьТранзакцию();        
	
	// Сделаем соответствие заявок на формы, чтобы не получать объект несколько раз, а также чтобы не проводить
	// одну и ту же заявку по несколько раз, т.к. в одном документе могут быть несколько форм одной заявки
	СоответствиеЗаявокНаФормы = Новый Соответствие;
	Для каждого ТекСтрока из ИзготовленныеФормы Цикл
		ТекЗаявкаНаФормыОбъект =  СоответствиеЗаявокНаФормы.Получить(ТекСтрока.ЗаявкаНаФормы);
		Если ТекЗаявкаНаФормыОбъект = Неопределено Тогда
			ТекЗаявкаНаФормыОбъект = ТекСтрока.ЗаявкаНаФормы.ПолучитьОбъект();
			СоответствиеЗаявокНаФормы.Вставить(ТекСтрока.ЗаявкаНаФормы, ТекЗаявкаНаФормыОбъект);
		КонецЕсли;
		ТекСтрокаЗаявкиНаФормы = ТекЗаявкаНаФормыОбъект.Цвета.Найти(ТекСтрока.КлючСтрокиЗаказа, "КлючСтрокиЗаказа");
		Если ТекСтрокаЗаявкиНаФормы = Неопределено Тогда
			ОтменитьТранзакцию();
			ВызватьИсключение(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "строка №" + ТекСтрока.НомерСтроки + ": не найдена связанная строка в заявке на формы");
		Иначе 
			Если ТекСтрокаЗаявкиНаФормы.Состояние <> Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен Тогда
				// Присвоим строке статус Выполнен
				ТекСтрокаЗаявкиНаФормы.Состояние = Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекЭлементСоответствия из СоответствиеЗаявокНаФормы Цикл
		ТекЗаявкаНаФормыОбъект = ТекЭлементСоответствия.Значение;
		// Проверим, все ли строки в заявке выполнены. Если все, то присвоим заявке состояние Выполнен, если нет, то присвоим состояние ВРаботе
		ОсталисьНевыполненныеСтрокиВЗаявке = Ложь;
		Для каждого ТекСтрокаЦвета из ТекЗаявкаНаФормыОбъект.Цвета Цикл
			Если ТекСтрокаЦвета.Состояние <> Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен Тогда
				ОсталисьНевыполненныеСтрокиВЗаявке = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОсталисьНевыполненныеСтрокиВЗаявке Тогда
			Если ТекЗаявкаНаФормыОбъект.ТекущееСостояние <> Перечисления.ТС_СостоянияРемонтныхРабот.ВРаботе Тогда
				// Поменяем состояние на ВРаботе
				ТекЗаявкаНаФормыОбъект.ТекущееСостояние = Перечисления.ТС_СостоянияРемонтныхРабот.ВРаботе;
				ТекЗаявкаНаФормыОбъект.Записать(?(ТекЗаявкаНаФормыОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				Лико_Дополнительно.УдалитьИзПланаНаСервере(ТекЗаявкаНаФормыОбъект.Ссылка, "ВРаботе", Ответственный);
			Иначе
				// Заявка уже ВРаботе, просто запишем ее, чтобы записалось состояние строк в ТЧ
				ТекЗаявкаНаФормыОбъект.Записать(?(ТекЗаявкаНаФормыОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		Иначе
			ТекЗаявкаНаФормыОбъект.ТекущееСостояние = Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен;
			ТекЗаявкаНаФормыОбъект.Записать(?(ТекЗаявкаНаФормыОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Лико_Дополнительно.ДобавитьЭтапНаСервере(Ответственный,ТекЗаявкаНаФормыОбъект.Ссылка,"Выполнен", "");
		КонецЕсли;
	КонецЦикла;

	Отказ = НЕ СоздатьТиповыеДокументы();
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	Отказ = Ложь;
	
	НачатьТранзакцию();

	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	
	//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если (ВидДокумента = 2 // Списание
		ИЛИ ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель <= 1) // последняя коробка 
		И НЕ Остаток // Обязательно без остатка, т.к. при остатке будем делать в любом случае закрытие бланка
		Тогда
		// Либо это списание, либо последняя коробка - создаем списание
		НовыйДокументЛико_ПередачаТоваров = СоздатьДокументЛико_ПередачаТоваров(СтруктураТиповыхДокументов.Лико_ПередачаТоваров);
		Если НовыйДокументЛико_ПередачаТоваров = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументЛико_ПередачаТоваров;
	Иначе
		НовыйДокументЛико_БланкЭтапа = СоздатьДокументЛико_БланкЭтапа(СтруктураТиповыхДокументов.Лико_БланкЭтапа);
		Если НовыйДокументЛико_БланкЭтапа = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументЛико_БланкЭтапа;
	КонецЕсли;
	
	//Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументЛико_ПередачаТоваров(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.Лико_ПередачаТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.АвторДокумента = Ответственный;
	НовыйДокОбъект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
	НовыйДокОбъект.Организация = Площадка.Организация;
	НовыйДокОбъект.Подразделение = Площадка.ПодразделениеПроизводство;
	НовыйДокОбъект.Склад = РабочийЦентр.ЛикоЯчейка.Владелец;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	НовыйДокОбъект.Помещение = НовыйДокОбъект.РабочееМесто.ПомещениеСИМ;
	НовыйДокОбъект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание;
	НовыйДокОбъект.АдресХранения = РабочийЦентр.ЛикоЯчейка;
	
	НоваяСтрокаТовары = НовыйДокОбъект.Товары.Добавить();
	НоваяСтрокаТовары.Номенклатура = ОбъектНоменклатурыКоробка.Номенклатура;
	НоваяСтрокаТовары.Серия = ОбъектНоменклатурыКоробка.Серия;
	НоваяСтрокаТовары.Упаковка = ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения;
	НоваяСтрокаТовары.Количество = НоваяСтрокаТовары.Упаковка.Числитель;
	НоваяСтрокаТовары.КоличествоУпаковок = 1;
	НоваяСтрокаТовары.СкладОтправитель = НовыйДокОбъект.Склад;
	НоваяСтрокаТовары.АдресХранения = НовыйДокОбъект.АдресХранения;
	НоваяСтрокаТовары.СтатусУказанияСерий = 8;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции  

Функция СоздатьДокументЛико_БланкЭтапа(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.Лико_БланкЭтапа.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.АвторДокумента = Ответственный;
	НовыйДокОбъект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
	НовыйДокОбъект.Организация = Площадка.Организация;
	НовыйДокОбъект.Подразделение = Площадка.ПодразделениеПроизводство;
	НовыйДокОбъект.Склад = РабочийЦентр.ЛикоЯчейка.Владелец;
	НовыйДокОбъект.СкладОтправитель = НовыйДокОбъект.Склад;
	НовыйДокОбъект.СкладПолучатель = НовыйДокОбъект.Склад;
	НовыйДокОбъект.Сотрудник = Лико_Дополнительно.ПолучитьСотрудникаПоФизЛицу(Ответственный);
	НовыйДокОбъект.РабочийЦентр = РабочийЦентр;
	НовыйДокОбъект.РежимЗакрытия = Перечисления.Лико_РежимЗакрытияЗаказа.ОставитьНаРабочемЦентре;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров;
	НовыйДокОбъект.ЗонаПриемки = НовыйДокОбъект.РабочееМесто.ЗонаПриемки;
	НовыйДокОбъект.Помещение = НовыйДокОбъект.РабочееМесто.ПомещениеСИМ;
	НовыйДокОбъект.ВидОперации = Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка;
	НовыйДокОбъект.ПоАктуРазборки = Истина; //? 
	
	НоваяСтрокаТовары = НовыйДокОбъект.Товары.Добавить();
	НоваяСтрокаТовары.Номенклатура = ОбъектНоменклатурыКоробка.Номенклатура;
	НоваяСтрокаТовары.Серия = ОбъектНоменклатурыКоробка.Серия;
	НоваяСтрокаТовары.Списать = Истина;
	НоваяСтрокаТовары.Упаковка = ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения;
	НоваяСтрокаТовары.КоличествоРасходУУ = НоваяСтрокаТовары.Упаковка.Числитель;
	НоваяСтрокаТовары.КоличествоРасход = 1;
	НоваяСтрокаТовары.Коэффициент = НоваяСтрокаТовары.КоличествоРасходУУ / НоваяСтрокаТовары.КоличествоРасход;
	НоваяСтрокаТовары.АдресХранения = РабочийЦентр.ЛикоЯчейка;
	
	Если ЗначениеЗаполнено(ОбъектНоменклатурыОстатокОтКоробки) Тогда
		НоваяСтрокаВыпуск = НовыйДокОбъект.Выпуск.Добавить();
		НоваяСтрокаВыпуск.Номенклатура = ОбъектНоменклатурыОстатокОтКоробки.Номенклатура;
		НоваяСтрокаВыпуск.Серия = ОбъектНоменклатурыОстатокОтКоробки.Серия;
		НоваяСтрокаВыпуск.Упаковка = ОбъектНоменклатурыОстатокОтКоробки.БазоваяЕдиницаИзмерения;
		НоваяСтрокаВыпуск.КоличествоУУ = НоваяСтрокаВыпуск.Упаковка.Числитель;
		НоваяСтрокаВыпуск.Количество = 1; 
		НоваяСтрокаВыпуск.СкладОтправитель = НовыйДокОбъект.Склад;
		НоваяСтрокаВыпуск.СкладПолучатель = НовыйДокОбъект.Склад;
		НоваяСтрокаВыпуск.АдресХранения = РабочийЦентр.ЛикоЯчейка;
	КонецЕсли;
	
	Для каждого ТекСтрокаОстатка из Остатки Цикл
		НоваяСтрокаВыпуск = НовыйДокОбъект.Выпуск.Добавить();	
		НоваяСтрокаВыпуск.Номенклатура = ТекСтрокаОстатка.ОбъектНоменклатуры.Номенклатура;
		НоваяСтрокаВыпуск.Серия = ТекСтрокаОстатка.ОбъектНоменклатуры.Серия;
		НоваяСтрокаВыпуск.Упаковка = ТекСтрокаОстатка.ОбъектНоменклатуры.БазоваяЕдиницаИзмерения;
		НоваяСтрокаВыпуск.КоличествоУУ = 1;
		НоваяСтрокаВыпуск.Количество = 1; 
		НоваяСтрокаВыпуск.СкладОтправитель = НовыйДокОбъект.Склад;
		НоваяСтрокаВыпуск.СкладПолучатель = НовыйДокОбъект.Склад;
		НоваяСтрокаВыпуск.АдресХранения = РабочийЦентр.ЛикоЯчейка;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();        
	
	// Уберем выполнение у заявок
	СоответствиеЗаявокНаФормы = Новый Соответствие;
	Для каждого ТекСтрока из ИзготовленныеФормы Цикл
		ТекЗаявкаНаФормыОбъект =  СоответствиеЗаявокНаФормы.Получить(ТекСтрока.ЗаявкаНаФормы);
		Если ТекЗаявкаНаФормыОбъект = Неопределено Тогда
			ТекЗаявкаНаФормыОбъект = ТекСтрока.ЗаявкаНаФормы.ПолучитьОбъект();
			СоответствиеЗаявокНаФормы.Вставить(ТекСтрока.ЗаявкаНаФормы, ТекЗаявкаНаФормыОбъект);
		КонецЕсли;
		ТекСтрокаЗаявкиНаФормы = ТекЗаявкаНаФормыОбъект.Цвета.Найти(ТекСтрока.КлючСтрокиЗаказа, "КлючСтрокиЗаказа");
		Если ТекСтрокаЗаявкиНаФормы = Неопределено Тогда
			ОтменитьТранзакцию();
			ВызватьИсключение(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "строка №" + ТекСтрока.НомерСтроки + ": не найдена связанная строка в заявке на формы");
		Иначе 
			Если ЗначениеЗаполнено(ТекСтрокаЗаявкиНаФормы.Состояние) Тогда
				// очистим состояние
				ТекСтрокаЗаявкиНаФормы.Состояние = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекЭлементСоответствия из СоответствиеЗаявокНаФормы Цикл
		ТекЗаявкаНаФормыОбъект = ТекЭлементСоответствия.Значение;
		Если ТекЗаявкаНаФормыОбъект.ТекущееСостояние = Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен Тогда
			ТекЗаявкаНаФормыОбъект.ТекущееСостояние = Перечисления.ТС_СостоянияРемонтныхРабот.ВРаботе;
			ТекЗаявкаНаФормыОбъект.Записать(?(ТекЗаявкаНаФормыОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Лико_Дополнительно.УдалитьИзПланаНаСервере(ТекЗаявкаНаФормыОбъект.Ссылка, "ВРаботе", Ответственный);
		Иначе
			ТекЗаявкаНаФормыОбъект.Записать(?(ТекЗаявкаНаФормыОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		КонецЕсли;
	КонецЦикла;
	
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодобратьОстатокОтКоробки()
	
	// Сначала очистим, а потом подберем при необходимости
	ОбъектНоменклатурыОстатокОтКоробки = Неопределено; 
	
	Если (ВидДокумента = 2 И КоличествоЛистовКСписанию = ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель) // Списывают всю коробку
		ИЛИ ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель <= 1 // В коробке остался последний лист
		ИЛИ НЕ ЗначениеЗаполнено(ОбъектНоменклатурыКоробка) // Коробка не выбрана?
		Тогда
		// Остаток от коробки не нужен
		Возврат;
	КонецЕсли;

	// Попробуем найти, вдруг уже создан нужный ОбъектНоменклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
		|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
		|ГДЕ
		|	НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
		|	И ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
		|	И ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Числитель = &Числитель
		|	И ЯССМ_ОбъектыНоменклатуры.Характеристика = &Характеристика
		|	И ЯССМ_ОбъектыНоменклатуры.Организация = &Организация
		|	И ЯССМ_ОбъектыНоменклатуры.ЗаказКлиента = &ЗаказКлиента
		|	И ЯССМ_ОбъектыНоменклатуры.РодительОбъектаНоменклатуры = &РодительОбъектаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Серия КАК Серия
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|		ПО ВТ.Серия = ТоварыВЯчейках.Серия
		|ГДЕ
		|	ТоварыВЯчейках.Период ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Ссылка,
		|	ВТ.Серия";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ОбъектНоменклатурыКоробка.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", ОбъектНоменклатурыКоробка.Номенклатура);
	Запрос.УстановитьПараметр("Организация", ОбъектНоменклатурыКоробка.Организация);
	Запрос.УстановитьПараметр("Характеристика", ОбъектНоменклатурыКоробка.Характеристика);
	Если ВидДокумента = 1 Тогда
		Запрос.УстановитьПараметр("Числитель", ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель - 1);
	Иначе
		Запрос.УстановитьПараметр("Числитель", ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения.Числитель - КоличествоЛистовКСписанию);
    КонецЕсли;
	Запрос.УстановитьПараметр("РодительОбъектаНоменклатуры", ?(ЗначениеЗаполнено(ОбъектНоменклатурыКоробка.РодительОбъектаНоменклатуры), ОбъектНоменклатурыКоробка.РодительОбъектаНоменклатуры, ОбъектНоменклатурыКоробка));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ОбъектНоменклатурыОстатокОтКоробки = Выборка.Ссылка;
		Возврат;
	КонецЕсли;

	// Не нашли, поэтому создаем новую
	СтруктураПараметров = Новый Структура("Номенклатура,Характеристика,Нарезка,Втулка,Количество,СерийныйНомер,Рулонный,Уникальный,УпотребитьДо,ДатаПроизводства,ВидКонтактаСПищевойПродукцией,НомерПартииИзготовления,Организация");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ОбъектНоменклатурыКоробка);
	СтруктураПараметров.Вставить("Упаковка", НайтиСоздатьЕдиницуИзмерения(ОбъектНоменклатурыКоробка.БазоваяЕдиницаИзмерения, Запрос.Параметры.Числитель));
	СтруктураПараметров.Вставить("РодительОбъектаНоменклатуры", Запрос.Параметры.РодительОбъектаНоменклатуры);
	Попытка
		ОбъектНоменклатурыОстатокОтКоробки = Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров)	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение "Не удалсь создать новый объект номенклатуры для остатка от коробки " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

Процедура ПодобратьОстаткиЛистов()
	
	Для каждого ТекСтрокаОстатка из Остатки Цикл
		ТекСтрокаОстатка.ОбъектНоменклатуры = Неопределено;

		// Попробуем найти, вдруг уже создан нужный ОбъектНоменклатуры
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
			|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
			|ГДЕ
			|	НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
			|	И ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
			|	И ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Наименование = ""Остаток от листа""
			|	И ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмеренияЛист
			|	И ЯССМ_ОбъектыНоменклатуры.Характеристика = &Характеристика
			|	И ЯССМ_ОбъектыНоменклатуры.Организация = &Организация
			|	И ЯССМ_ОбъектыНоменклатуры.ЗаказКлиента = &ЗаказКлиента
			|	И ЯССМ_ОбъектыНоменклатуры.РодительОбъектаНоменклатуры = &РодительОбъектаНоменклатуры
			|	И ЯССМ_ОбъектыНоменклатуры.Длина = &Длина
			|	И ЯССМ_ОбъектыНоменклатуры.Ширина = &Ширина
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВТ.Серия КАК Серия
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
			|		ПО ВТ.Серия = ТоварыВЯчейках.Серия
			|ГДЕ
			|	ТоварыВЯчейках.Период ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ.Ссылка,
			|	ВТ.Серия";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ОбъектНоменклатурыКоробка.ЗаказКлиента);
		Запрос.УстановитьПараметр("Номенклатура", ОбъектНоменклатурыКоробка.Номенклатура);
		Запрос.УстановитьПараметр("Организация", ОбъектНоменклатурыКоробка.Организация);
		Запрос.УстановитьПараметр("Характеристика", ОбъектНоменклатурыКоробка.Характеристика);
		Запрос.УстановитьПараметр("РодительОбъектаНоменклатуры", ?(ЗначениеЗаполнено(ОбъектНоменклатурыКоробка.РодительОбъектаНоменклатуры), ОбъектНоменклатурыКоробка.РодительОбъектаНоменклатуры, ОбъектНоменклатурыКоробка));
		Запрос.УстановитьПараметр("Длина", ТекСтрокаОстатка.Длина);
		Запрос.УстановитьПараметр("Ширина", ТекСтрокаОстатка.Ширина);
		ЕдиницаИзмеренияОстатокОтЛистаШаблон = Справочники.Лико_ПредопределенныеЗначения.ЕдиницаИзмеренияОстатокОтЛистаШаблон.ЗначениеПараметра;
		Запрос.УстановитьПараметр("ЕдиницаИзмеренияЛист", ЕдиницаИзмеренияОстатокОтЛистаШаблон.ЕдиницаИзмерения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ТекСтрокаОстатка.ОбъектНоменклатуры = Выборка.Ссылка;
			Продолжить;
		КонецЕсли;

		// Не нашли, поэтому создаем новую
		СтруктураПараметров = Новый Структура("Номенклатура,Характеристика,Нарезка,Втулка,Количество,СерийныйНомер,Рулонный,Уникальный,УпотребитьДо,ДатаПроизводства,ВидКонтактаСПищевойПродукцией,НомерПартииИзготовления,Организация");
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ОбъектНоменклатурыКоробка);
		СтруктураПараметров.Вставить("Упаковка", НайтиСоздатьЕдиницуИзмеренияЛист(ЕдиницаИзмеренияОстатокОтЛистаШаблон));
		СтруктураПараметров.Вставить("РодительОбъектаНоменклатуры", Запрос.Параметры.РодительОбъектаНоменклатуры);
		СтруктураПараметров.Вставить("Длина", Запрос.Параметры.Длина);
		СтруктураПараметров.Вставить("Ширина", Запрос.Параметры.Ширина);
		Попытка
			ТекСтрокаОстатка.ОбъектНоменклатуры = Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров)	
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение "Не удалсь создать новый объект номенклатуры для остатка от коробки " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСоздатьЕдиницуИзмерения(ТекущаяЕдИзм, Числитель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		|	И УпаковкиЕдиницыИзмерения.Родитель = &Родитель
		|	И НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И УпаковкиЕдиницыИзмерения.Числитель = &Числитель
		|	И УпаковкиЕдиницыИзмерения.Знаменатель = &Знаменатель
		|	И УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = &ТипИзмеряемойВеличины
		|	И УпаковкиЕдиницыИзмерения.ТипУпаковки = &ТипУпаковки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", ТекущаяЕдИзм.Владелец);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ТекущаяЕдИзм.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Знаменатель", ТекущаяЕдИзм.Знаменатель);
	Запрос.УстановитьПараметр("Родитель", ТекущаяЕдИзм.Родитель);
	Запрос.УстановитьПараметр("ТипИзмеряемойВеличины", ТекущаяЕдИзм.ТипИзмеряемойВеличины);
	Запрос.УстановитьПараметр("ТипУпаковки", ТекущаяЕдИзм.ТипУпаковки);
	Запрос.УстановитьПараметр("Числитель", Числитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НоваяУпаковкиЕдиницыИзмерения = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяУпаковкиЕдиницыИзмерения, ТекущаяЕдИзм,, "Ссылка,Числитель");
		НоваяУпаковкиЕдиницыИзмерения.Числитель = Числитель;
		НоваяУпаковкиЕдиницыИзмерения.Наименование = СтрЗаменить(НоваяУпаковкиЕдиницыИзмерения.Наименование, Формат(ТекущаяЕдИзм.Числитель, "ЧДЦ=0; ЧГ=0"), Формат(Числитель, "ЧДЦ=0; ЧГ=0"));
		Если ЗначениеЗаполнено(НоваяУпаковкиЕдиницыИзмерения.НаименованиеПолное) Тогда
			НоваяУпаковкиЕдиницыИзмерения.НаименованиеПолное = СтрЗаменить(НоваяУпаковкиЕдиницыИзмерения.Наименование, Формат(ТекущаяЕдИзм.Числитель, "ЧДЦ=0; ЧГ=0"), Формат(Числитель, "ЧДЦ=0; ЧГ=0"));
		КонецЕсли;
		Попытка
			НоваяУпаковкиЕдиницыИзмерения.Записать(); 
			Возврат НоваяУпаковкиЕдиницыИзмерения.Ссылка;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение "Не удалось создать новую упаковку " + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

Функция НайтиСоздатьЕдиницуИзмеренияЛист(ЕдиницаИзмеренияОстатокОтЛистаШаблон)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		|	И НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмеренияЛист
		|	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", ОбъектНоменклатурыКоробка.Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияЛист", ЕдиницаИзмеренияОстатокОтЛистаШаблон.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Наименование", ЕдиницаИзмеренияОстатокОтЛистаШаблон.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НоваяУпаковкиЕдиницыИзмерения = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяУпаковкиЕдиницыИзмерения, ЕдиницаИзмеренияОстатокОтЛистаШаблон,, "Ссылка");
		Попытка
			НоваяУпаковкиЕдиницыИзмерения.Записать(); 
			Возврат НоваяУпаковкиЕдиницыИзмерения.Ссылка;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение "Не удалось создать новую упаковку " + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

КлючиСтруктуры =	"Лико_БланкЭтапа,
					|Лико_ПередачаТоваров";
